Enums/ВидыПараметровИгроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыПараметровИгроков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БлокировкаЛечения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бомба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Горение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Золото</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальноеЗдоровье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неуклюжесть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проклятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сила</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекущееЗдоровье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Щит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Энергия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Яд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ярость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛедянойЩит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПараметровИгроков/Ext/ManagerModule.bsl
// Вовзращает массив уменьшаемых парамтеров игрока.
//
// Возвращаемое значение:
// Массив - Массив, содержащий значения для уменьшаемых параметров игрока.
//
Функция ПолучитьУменьшаемыеПараметрыИгроков() Экспорт
	РезультатФункции = Новый Массив;
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.БлокировкаЛечения);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Бомба);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Горение);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.ЛедянойЩит);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Неуклюжесть);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Проклятие);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Яд);
	Возврат РезультатФункции;
КонецФункции

// Возвращает массив положительных параметров игрока.
//
// Возвращаемое значение:
// Массив - Массив, содержащий значения для положительных параметров игрока.
//
Функция ПолучитьПоложительныеПараметры() Экспорт
	РезультатФункции = Новый Массив;
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.ЛедянойЩит);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Сила);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Щит);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Ярость);
	Возврат РезультатФункции;
КонецФункции

// Возвращает массив отрицательных параметров игрока.
//
// Возвращаемое значение:
// Массив - Массив, содержащий значения для отрицательных параметров игрока.
//
Функция ПолучитьОтрицательныеПараметры() Экспорт
	РезультатФункции = Новый Массив;
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Бомба);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Неуклюжесть);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Проклятие);
	Возврат РезультатФункции;
КонецФункции

// Возвращает массив основных параметров игрока.
//
// Возвращаемое значение:
// Массив - Массив, содержащий значения для основных параметров игрока.
//
Функция ПолучитьОсновныеПараметры() Экспорт
	РезультатФункции = Новый Массив;
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Золото);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.МаксимальноеЗдоровье);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.ТекущееЗдоровье);
	РезультатФункции.Добавить(Перечисления.ВидыПараметровИгроков.Энергия);
	Возврат РезультатФункции;
КонецФункции
